天氣 = ["晴", "多雲", "陰雲", "陽光", "雨", "雪", "雷雨"]
print(天氣)

while True:
    try:
        要修改的星期 = int(input("請輸入要修改的星期:"))
    except:
        print("請輸入數字編號")
    else:
        if 要修改的星期 > len(天氣) or 要修改的星期 < 1:
            print("輸入錯誤查無此星期，請重新輸入")
        else:
            print("您要修改的星期是" + str(要修改的星期))
            print("原本的天氣是" + str(天氣[要修改的星期 - 1]))
            要改成的天氣 = input("請輸入想要修改的天氣:")
            天氣[要修改的星期 - 1] = 要改成的天氣
            print("您要修改的天氣是" + str(天氣[要修改的星期 - 1]))
            print(天氣)
