"""
你製作了一台飲料機!這台飲料機有四個按鈕,每個按鈕都會給出不同的飲料:
1.蘋果汁
2.柳橙汁
3.葡萄汁
4.系統關閉
客人會按這些按鈕來選擇他們想要的飲料。選擇後系統會告訴他們他們選了什麼飲料,但是,如果客人選擇了「系統關閉」,飲料機就會停止工作。
如果客人按錯了按鈕(也就是輸入了不正確的編號),你需要告訴他們「輸入錯誤查無此果汁,請重新輸入」。
"""

f = 1

while f == 1:
    print("選項有四種:")
    print("1.蘋果汁")
    print("2.柳橙汁")
    print("3.葡萄汁")
    print("4.系統結束")
    try:
        a = int(input("請輸入選項數字:"))
    except:
        print("請輸入有選項數字")
    else:
        if a == 1:
            print("您輸入的選項為蘋果汁")
        elif a == 2:
            print("您輸入的選項為柳橙汁")
        elif a == 3:
            print("您輸入的選項為葡萄汁")
        elif a == 4:
            print("您輸入的選項為系統結束")
            break
        else:
            print("請輸入有效的選項")


print("系統結束")
