"""
回家作業1
修改上課的練習程式，當使用者輸入數值時，程式不僅提示再大再小還需要提示縮小過後的輸入範圍
EX:
請輸入0~100的整數:50
再小一點
請輸入0~50的整數:25
再小一點
請輸入0~25的整數:15
再大一點
請輸入15~25的整數:30
再小一點
請輸入15~25的整數:10
再大一點
請輸入15~25的整數:20
再大一點
請輸入20~25的整數:23
再大一點
請輸入23~25的整數:24
恭喜猜中!
"""

import random as r


最小 = 1
最大 = 100
次數 = 0
答案 = r.randint(1, 100)
print("程式開始")
while True:
    try:
        你猜得數字 = int(input(f"請輸入一個{最小}~{最大}的數字:"))
    except:
        print("請輸入有效數字")
        continue
    if 你猜得數字 == 答案:
        break
    elif 你猜得數字 < 答案:
        print("再大一點")
        最小 = 你猜得數字
        次數 += 1
    else:
        print("再小一點")
        次數 += 1
        最大 = 你猜得數字

print("恭喜猜中")
print(f"你猜的次數是:{次數}")
print("程式結束")
