# 練習:猜數字遊戲
"""
隨機生成一個答案(1~100之間)存入變數當中,讓使用者猜測此數字
根據使用者輸入數字,程式會提示使用者猜測的方向:
如果輸入的數字小於目標,提示使用者『再大一點』,
如果輸入的數字大於目標,提示使用者『再小一點』,
如果輸入的數字等於目標,顯示『猜中了』並結束程式。
"""

import random as r

次數 = 0
答案 = r.randint(1, 100)
print("程式開始")
while True:
    try:
        你猜得數字 = int(input("請輸入一個1~100的數字:"))
    except:
        print("請輸入有效數字")
        continue
    if 你猜得數字 == 答案:
        break
    elif 你猜得數字 < 答案:
        print("在大一點")
        次數 += 1
    else:
        print("在小一點")
        次數 += 1

print("恭喜猜中")
print(f"你猜的次數是:{次數}")
print("程式結束")
